src/InformationRegisters/уатСтатусыГрузов_уэ/уатСтатусыГрузов_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатСтатусыГрузов_уэ</name>
  <comment>Статусы грузов (уэ)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.уатСтатусы_уэ</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрузовоеМесто</name>
    <type>
      <types>CatalogRef.уатГрузовыеМеста_уэ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/уатЭтапыМультимодальныхПеревозок_уэ/уатЭтапыМультимодальныхПеревозок_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатЭтапыМультимодальныхПеревозок_уэ</name>
  <resources>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправленияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПрибытияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>xПунктаНазначения</name>
    <comment>Используется для отображения на схеме перевозок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>xПунктаОтправления</name>
    <comment>Используется для отображения на схеме перевозок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>yПунктаНазначения</name>
    <comment>Используется для отображения на схеме перевозок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>yПунктаОтправления</name>
    <comment>Используется для отображения на схеме перевозок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСПеревозчиком</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаФормированияКомплектовДокументов</name>
    <type>
      <types>CatalogRef.уатНастройкиКомплектовДокументов_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьАктОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьАктПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИзвлечениеГрузовИзКонтейнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьМаршрутныйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьРазмещениеГрузовВКонтейнере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТС</name>
    <type>
      <types>CatalogRef.уатТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейОтНачалаОтправление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейОтНачалаНазначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказГрузоотправителя</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/уатТипыСобытийДляУведомления_уэ/уатТипыСобытийДляУведомления_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатТипыСобытийДляУведомления_уэ</name>
  <enumValues>
    <name>ЗагрузкаИзМониторинга</name>
  </enumValues>
  <enumValues>
    <name>ЗакреплениеМаршрутногоЛистаЗаПеревозчиком</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеВесообъемныхХарактеристик</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеВодителя</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПунктовМаршрута</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаГрузовогоМеста</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаОтветаПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаОтправления</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаПолучения</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаРодительскогоЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеТС</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаСобытия</name>
  </enumValues>
  <enumValues>
    <name>ПрибытиеВПунктПланИзменено</name>
  </enumValues>
  <enumValues>
    <name>ПрибытиеВПунктФактИзменено</name>
  </enumValues>
  <enumValues>
    <name>ПрогнозОпозданияПоМаршрутномуЛисту</name>
  </enumValues>
  <enumValues>
    <name>РасхожденияПоСкладскомуАкту</name>
  </enumValues>
  <enumValues>
    <name>УбытиеИзПунктаПланИзменено</name>
  </enumValues>
  <enumValues>
    <name>УбытиеИзПунктаФактИзменено</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПеревозчикуПоСопроводительнымДокументам</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатСтатусы_уэ/уатСтатусы_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатСтатусы_уэ</name>
  <comment>Статусы грузов и документов</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Аннулировано</name>
      <description>Аннулировано</description>
    </items>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>ВИсполнении</name>
      <description>В исполнении</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВыданВРейс</name>
      <description>Выдан в рейс</description>
    </items>
    <items>
      <name>ВыданСоСклада</name>
      <description>Выдан со склада</description>
    </items>
    <items>
      <name>ВыданСоСкладаКлиента</name>
      <description>Выдан со склада клиента</description>
    </items>
    <items>
      <name>Выполнен</name>
      <description>Выполнен</description>
    </items>
    <items>
      <name>Выпущен</name>
      <description>Выпущен</description>
    </items>
    <items>
      <name>Доставлен</name>
      <description>Доставлен</description>
    </items>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Закрыт</name>
      <description>Закрыт</description>
    </items>
    <items>
      <name>МатериалыВыданы</name>
      <description>Материалы выданы</description>
    </items>
    <items>
      <name>НазначенРемонт</name>
      <description>Назначен ремонт</description>
    </items>
    <items>
      <name>НеПодтвержден</name>
      <description>Не подтвержден</description>
    </items>
    <items>
      <name>НеПройдено</name>
      <description>Не пройдено</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>ОбработкаЗавершена</name>
      <description>Обработка завершена</description>
    </items>
    <items>
      <name>Опубликовано</name>
      <description>Опубликовано</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Открыт</name>
      <description>Открыт</description>
    </items>
    <items>
      <name>Отправлен</name>
      <description>Отправлен</description>
    </items>
    <items>
      <name>ПовреждениеГруза</name>
      <description>Повреждение груза</description>
    </items>
    <items>
      <name>ПовреждениеУпаковки</name>
      <description>Повреждение упаковки</description>
    </items>
    <items>
      <name>Подтвержден</name>
      <description>Подтвержден</description>
    </items>
    <items>
      <name>ПодтвержденСЗамечаниями</name>
      <description>Подтвержден с замечаниями</description>
    </items>
    <items>
      <name>ПринятИзРейса</name>
      <description>Принят из рейса</description>
    </items>
    <items>
      <name>ПринятИзРейсаКлиентом</name>
      <description>Принят из рейса клиентом</description>
    </items>
    <items>
      <name>ДоставленНаСклад</name>
      <description>Принят на склад</description>
    </items>
    <items>
      <name>Пройдено</name>
      <description>Пройдено</description>
    </items>
    <items>
      <name>Размещен</name>
      <description>Размещен</description>
    </items>
    <items>
      <name>РазмещениеВКонтейнере</name>
      <description>Размещение в контейнере</description>
    </items>
    <items>
      <name>Разукомплектован</name>
      <description>Разукомплектован</description>
    </items>
    <items>
      <name>РемонтВыполнен</name>
      <description>Ремонт выполнен</description>
    </items>
    <items>
      <name>Скомплектован</name>
      <description>Скомплектован</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>Составной</name>
      <description>Составной</description>
    </items>
    <items>
      <name>Утвержден</name>
      <description>Утвержден</description>
    </items>
  </predefined>
  <attributes>
    <name>ДействуетНаАктыОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаАктыПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаЗаказыГрузоотправителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаЗаказыПеревозчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаЗаявкиНаРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаОперацииСГрузами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаПотребностиВПеревозке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСопроводительныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенДляВыбораВМобильномПриложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСтраховыеСертификаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаТендеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаЖурналыТранспортныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаПоУмолчанию</name>
    <comment>Цвет фона статуса для подсветки в списках по умолчанию</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаПоУмолчанию</name>
    <comment>Цвет фона статуса для подсветки в списках по умолчанию</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВладельца</name>
    <type>
      <types>EnumRef.уатВидыВладельцевСопроводительныхДокументов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/уатСтатусыГрузов_уэ/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
	Исключение
		Регистратор = Неопределено;
	КонецПопытки;
	
	Если НЕ Отказ 
		И НЕ ТипЗнч(Регистратор) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
		
		Для Каждого ТекЗапись Из ЭтотОбъект Цикл
			
			Если ТекЗапись.Статус = Справочники.уатСтатусы_уэ.Отклонен Тогда
				ТекДок = ТекЗапись.Заказ.ПолучитьОбъект();
				
				ТекстОшибкиЗаписи = "";
				
				Попытка 
					ТекДок.ДополнительныеСвойства.Вставить("НеФормироватьДвиженийПоУслугам", Истина);
					ТекДок.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ТекстОшибкиЗаписи = ОписаниеОшибки();
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

	Если Не Отказ И ПолучитьФункциональнуюОпцию("уатИспользоватьУведомления_уэ") Тогда
	
		Если ЭтотОбъект.Количество() > 0 И ДополнительныеСвойства.Свойство("ПредыдущиеЗаписи") Тогда
			// Создание новых записей регистра после удаления старых.
			СформироватьУведомленияПоТекущимЗаписям(ДополнительныеСвойства.ПредыдущиеЗаписи);
		ИначеЕсли ЭтотОбъект.Количество() > 0 Тогда
			// Создание новых записей регистра без удаления старых.
			ПредыдущиеЗаписи = ЭтотОбъект.ВыгрузитьКолонки("Заказ, ГрузовоеМесто, Статус, Период");
			СформироватьУведомленияПоТекущимЗаписям(ПредыдущиеЗаписи);
		ИначеЕсли ЭтотОбъект.Количество() = 0 Тогда
			// Удаление записей регистра.
			// Запоминаются старые значения записей регистра перед их удалением.
			ЭтотОбъект.Прочитать();
			ТаблицаСтатусов = ЭтотОбъект.Выгрузить(,"Заказ, ГрузовоеМесто, Статус, Период");
			ЭтотОбъект.Очистить();
			
			ДополнительныеСвойства.Вставить("ПредыдущиеЗаписи", ТаблицаСтатусов);
			
		КонецЕсли;
	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	// Уведомления
	Если Не Отказ И ДополнительныеСвойства.Свойство("НовыеЗаписи") Тогда
		
		// Проверка наличия правил формирования уведомлений по событию "Изменение статуса родительского заказа".
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	уатПравилаФормированияУведомлений_уэ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.уатПравилаФормированияУведомлений_уэ КАК уатПравилаФормированияУведомлений_уэ
		|ГДЕ
		|	уатПравилаФормированияУведомлений_уэ.ТипСобытия = &ТипСобытия");
		Запрос.УстановитьПараметр("ТипСобытия", Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатусаРодительскогоЗаказа);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	НовыеЗаписи.Заказ КАК Заказ,
			|	НовыеЗаписи.Статус КАК Статус,
			|	НовыеЗаписи.Период КАК Период
			|ПОМЕСТИТЬ втНовыеЗаписи
			|ИЗ
			|	&НовыеЗаписи КАК НовыеЗаписи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втНовыеЗаписи.Статус КАК ПотенциальныйНовыйСтатус,
			|	уатЗаказГрузоотправителя.РодительскийЗаказ КАК РодительскийЗаказ,
			|	втНовыеЗаписи.Период КАК ДатаУстановкиСтатуса
			|ПОМЕСТИТЬ втРодительскиеЗаказыСоСтатусами
			|ИЗ
			|	Документ.уатЗаказГрузоотправителя КАК уатЗаказГрузоотправителя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНовыеЗаписи КАК втНовыеЗаписи
			|		ПО (втНовыеЗаписи.Заказ = уатЗаказГрузоотправителя.Ссылка)
			|ГДЕ
			|	уатЗаказГрузоотправителя.Мультимодальный = ИСТИНА
			|	И уатЗаказГрузоотправителя.ЭтоЭтап = ИСТИНА
			|
			|СГРУППИРОВАТЬ ПО
			|	уатЗаказГрузоотправителя.РодительскийЗаказ,
			|	втНовыеЗаписи.Статус,
			|	втНовыеЗаписи.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
			|	уатЭтапыМультимодальныхПеревозок_уэ.Этап КАК Этап
			|ПОМЕСТИТЬ втРодительскиеЗаказыСЭтапами
			|ИЗ
			|	РегистрСведений.уатЭтапыМультимодальныхПеревозок_уэ КАК уатЭтапыМультимодальныхПеревозок_уэ
			|ГДЕ
			|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя В
			|			(ВЫБРАТЬ
			|				втРодительскиеЗаказыСоСтатусами.РодительскийЗаказ
			|			ИЗ
			|				втРодительскиеЗаказыСоСтатусами КАК втРодительскиеЗаказыСоСтатусами)
			|
			|СГРУППИРОВАТЬ ПО
			|	уатЭтапыМультимодальныхПеревозок_уэ.ЗаказГрузоотправителя,
			|	уатЭтапыМультимодальныхПеревозок_уэ.Этап
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втРодительскиеЗаказыСЭтапами.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
			|	ВЫБОР
			|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый))) > 1
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Составной)
			|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(уатСтатусыГрузов_уэСрезПоследних.Статус, ЗНАЧЕНИЕ(Справочник.уатСтатусы_уэ.Новый)))
			|	КОНЕЦ КАК СтатусЗаказа
			|ПОМЕСТИТЬ втСтатусыРодительскихЗаказов
			|ИЗ
			|	втРодительскиеЗаказыСЭтапами КАК втРодительскиеЗаказыСЭтапами
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСтатусыГрузов_уэ.СрезПоследних КАК уатСтатусыГрузов_уэСрезПоследних
			|		ПО (уатСтатусыГрузов_уэСрезПоследних.Заказ = втРодительскиеЗаказыСЭтапами.Этап)
			|
			|СГРУППИРОВАТЬ ПО
			|	втРодительскиеЗаказыСЭтапами.ЗаказГрузоотправителя
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втСтатусыРодительскихЗаказов.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
			|	втРодительскиеЗаказыСоСтатусами.ПотенциальныйНовыйСтатус КАК Статус,
			|	втРодительскиеЗаказыСоСтатусами.ДатаУстановкиСтатуса КАК ДатаУстановкиСтатуса
			|ИЗ
			|	втРодительскиеЗаказыСоСтатусами КАК втРодительскиеЗаказыСоСтатусами
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтатусыРодительскихЗаказов КАК втСтатусыРодительскихЗаказов
			|		ПО втРодительскиеЗаказыСоСтатусами.ПотенциальныйНовыйСтатус = втСтатусыРодительскихЗаказов.СтатусЗаказа
			|			И втРодительскиеЗаказыСоСтатусами.РодительскийЗаказ = втСтатусыРодительскихЗаказов.ЗаказГрузоотправителя");
			Запрос.УстановитьПараметр("НовыеЗаписи", ДополнительныеСвойства.НовыеЗаписи);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДополнительныеПараметры = Новый Структура("Статус, ДатаУстановкиСтатуса", Выборка.Статус, Выборка.ДатаУстановкиСтатуса);
				уатОбщегоНазначения_уэ.СформироватьУведомление(
					Выборка.ЗаказГрузоотправителя,
					Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатусаРодительскогоЗаказа,
					ДополнительныеПараметры
				);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьУведомленияПоТекущимЗаписям(ПредыдущиеЗаписи)
	// Старые записи сравниваются с новыми, находятся записи, которых раньше не было, для них формируются уведомления.
	ТекущиеЗаписи = ЭтотОбъект.Выгрузить(,"Заказ, ГрузовоеМесто, Статус, Период, Регистратор");
	НовыеЗаписи = ТекущиеЗаписи.СкопироватьКолонки();
	
	// Не отслеживается изменение времени установки уже установленного статуса - колонки Период
	СтруктураПоиска = Новый Структура("Заказ, ГрузовоеМесто, Статус");
	Для Каждого ТекСтрока Из ТекущиеЗаписи Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекСтрока);
		Если ПредыдущиеЗаписи.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			НоваяСтрока = НовыеЗаписи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Если НовыеЗаписи.Количество() > 0 Тогда
		ДополнительныеСвойства.Вставить("НовыеЗаписи", НовыеЗаписи);
	КонецЕсли;
	
	Для Каждого ТекСтрока Из НовыеЗаписи Цикл
		СформироватьУведомлениеПоЗаписи(ТекСтрока);
	КонецЦикла;
КонецПроцедуры
	
Процедура СформироватьУведомлениеПоЗаписи(ТекЗапись)
	
	Если НЕ ЗначениеЗаполнено(ТекЗапись.Заказ) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Статус", ТекЗапись.Статус);
	ДополнительныеПараметры.Вставить("ДатаУстановкиСтатуса", ТекЗапись.Период);
	Если ТипЗнч(ТекЗапись.Регистратор) = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
		ДополнительныеПараметры.Вставить("ДополнительныйДокумент", ТекЗапись.Регистратор);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ТекЗапись.ГрузовоеМесто) Тогда
		ДополнительныеПараметры.Вставить("ГрузовоеМесто", ТекЗапись.ГрузовоеМесто);
		ТипСобытия = Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатусаГрузовогоМеста;
	Иначе
		ТипСобытия = Перечисления.уатТипыСобытийДляУведомления_уэ.ИзменениеСтатуса;
	КонецЕсли;
	уатОбщегоНазначения_уэ.СформироватьУведомление(
		ТекЗапись.Заказ,
		ТипСобытия,
		ДополнительныеПараметры
	);
КонецПроцедуры

#КонецОбласти
